OpenFOAM file/OpenFOAM/cfdm-v2412/run/tutorials/incompressible/icoFoam/cavity/cavity/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2412                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
     FrontBack
    {
        type            empty;
      
    }
    Top
    {
        type            noSlip;
        
      
    }
    In
    {
       type            fixedValue;
       value           uniform (1 0 0);
      
    }
    Bottom
    {
        type            noSlip;
      
        
    }
    Out
    {
        type            zeroGradient;
        }
       
    circle
    {
        type           noSlip;
      
    }
}


// ************************************************************************* //
