OpenFOAM file/OpenFOAM/cfdm-v2412/run/tutorials/incompressible/icoFoam/cavity/cavity/0/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2412                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    FrontBack
    {
        type            empty;
      
    }
    Top
    {
        type            zeroGradient;
        
      
    }
    In
    {
        type            zeroGradient;
      
    }
    Bottom
    {
        type            zeroGradient;
      
        
    }
    Out
    {
        type            fixedValue;
        value           uniform 0;
    }
    circle
    {
        type           zeroGradient;
      
    }
}


// ************************************************************************* //
