OpenFOAM file/OpenFOAM/cfdm-v2412/run/tutorials/incompressible/icoFoam/cavity/cavity/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2412                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    FrontBack
    {
        type            empty;
      
        nFaces          1616;
        startFace       1171;
    }
    Top
    {
        type            wall;
        
        nFaces          15;
        startFace       2787;
    }
    In
    {
        type            patch;
       
        nFaces          10;
        startFace       2802;
    }
    Bottom
    {
        type            wall;
      
        nFaces          15;
        startFace       2812;
    }
    Out
    {
        type            patch;
      
        nFaces          10;
        startFace       2827;
    }
    circle
    {
        type            wall;
       
        nFaces          32;
        startFace       2837;
    }
)

// ************************************************************************* //
